#!/usr/bin/env bash
#
# extrai_titulos.sh- descrição simples: Extrai os titulos de um site
# Site:
# Autor:
# Manutenção: 
#
# ------------------------------------------------------------------------ #
#
# ------------------------------------------------------------------------ #
# Histórico:
#
#   v1.0 27.01.2022, Alessa:
#
# ------------------------------------------------------------------------ #
# Testado em:
#   bash 5.0.17
# ------------------------------------------------------------------------ #
#
# ------------------------------- VARIÁVEIS ----------------------------------------- #

ARQUIVO_DE_TITULOS="titulos.txt"

VERDE="\033[32;1m"
VERMELHO="\033[31;1m"
# ------------------------------------------------------------------------ #

# ------------------------------- TESTES ----------------------------------------- #
[ ! -x "$(which lynx)" ] && sudo apt install lynx -y #Lynx instalado

# ------------------------------- EXECUÇÃO ----------------------------------------- #
lynx -source http://lxer.com/ | grep blurb | sed 's/<div.*line">//;s/<\/span.*//' > titulos.txt

while read -r titulo_lxer
do
  echo -e "${VERMELHO}Titulo: ${VERDE}$titulo_lxer"
done < "$ARQUIVO_DE_TITULOS"

# ------------------------------------------------------------------------ #
